# Consultas SQL basicas INSERT

En esta sección continuaremos con consultas básicas de SQL, veremos las instrucciones **INSERT**, **UPDATE** y **DELETE**.

## Instrucción INSERT

La instrucción **INSERT** nos va a permitir insertar registros a una tabla de nuestra base de datos. La sintaxis de la instrucción **INSERT** es:

``` SQL

INSERT INTO table_name VALUES(column1_value, column2_value, column3_value)

```

Para esta sección vamos a crear una nueva base de datos con una tabla llamado `employees` (empleados) que contará con las siguientes tres columnas:

1. Nombre
2. Apellido
3. Edad
4. Salario

In [1]:
# Nos conectamos a la base de datos. En caso no exista, creará una nueva base de datos

import sqlite3

conn = sqlite3.connect('employee.db')
cursor = conn.cursor()

In [2]:
# Creamos la tabla employees

cursor.execute('''CREATE TABLE employees(
                    first_name TEXT,
                    last_name TEXT,
                    age INTEGER,
                    salary INTEGER
                )''')

Inicialmente nuestra tabla está vacía:

In [3]:
cursor.execute('SELECT * FROM employees')

rows = cursor.fetchall()

# Obtenemos una lista vacía, sin registros
rows

[]

Ahora insertaremos un registro con la instrucción **INSERT**:

In [9]:
cursor.execute("INSERT INTO employees VALUES ('Jhon', 'Campos', 24, 6000)")

# Es importante poner conn.commit() luego de cursor.execute(), sino no se insertará el registro en la tabla
conn.commit()

Nuevamente ejecutamos un **SELECT** en nuestra tabla y verificamos que el registro se ha insertado en la tabla:

In [10]:
cursor.execute('SELECT * FROM employees')

rows = cursor.fetchall()
rows

[('Jhon', 'Campos', 24, 6000)]

Y podemos seguir insertando más valores a nuestra base de datos:

In [11]:
cursor.execute("INSERT INTO employees VALUES ('Maria', 'Cruz', 22, 7000)")
conn.commit()

In [12]:
cursor.execute("INSERT INTO employees VALUES ('Cielo', 'Ruiz', 27, 8000)")
conn.commit()

In [14]:
cursor.execute('SELECT * FROM employees')

rows = cursor.fetchall()
rows

[('Jhon', 'Campos', 24, 6000),
 ('Maria', 'Cruz', 22, 7000),
 ('Cielo', 'Ruiz', 27, 8000)]

Cuando conectamos una base de datos a Python, nos interesa insertar variablesde nuestro programa a las bases de datos. Imaginemos que contamos con una clase *Employee*.

In [15]:
class Employee():
    def __init__(self, first_name, last_name, age, salary):
        self.first_name = first_name
        self.last_name = last_name
        self.age = age
        self.salary = salary

In [27]:
emp1 = Employee('Raul', 'Canales', 30, 100000)
emp2 = Employee('Jorge', 'Rodriguez', 20, 3800)
emp3 = Employee('Mateo', 'Puente', 26, 5000)

Queremos insertar estos datos de empleados a nuestra tabla `employees` de nuestra base de datos:

In [17]:
print(emp1.first_name)
print(emp1.last_name)
print(emp1.age)
print(emp1.salary)

Raul
Canales
30
100000

Primero usaremos el método `format()` de las cadenas:

In [21]:
query = "INSERT INTO employees VALUES ('{}', '{}', {}, {})".format(emp1.first_name, emp1.last_name, emp1.age, emp1.salary)

En la cadena observamos que hay 4 `{}` y dentro de los parámetros de `format()` indicamos 4 variables (los atributos del objeto `emp1`). Cada `{}` será reemplazado por una variable, en orden de izquierda a derecha (nótese que algunos `{}` se encuentra entre comillas, para así indicar que se tratan de texto). El resultado que obtendremos será:

In [22]:
query

"INSERT INTO employees VALUES ('Raul', 'Canales', 30, 100000)"

Y vemos que `query` cumple con la sintaxis de la instrucción **SELECT**. Por lo que simplemente ejecutamos la `query`:

In [23]:
cursor.execute(query)
conn.commit()

Verificamos si se ha añadido a la tabla:

In [24]:
cursor.execute('SELECT * FROM employees')

rows = cursor.fetchall()
rows

[('Jhon', 'Campos', 24, 6000),
 ('Maria', 'Cruz', 22, 7000),
 ('Cielo', 'Ruiz', 27, 8000),
 ('Raul', 'Canales', 30, 100000)]

Veamos otra manera de insertar registros es usando el propio método `execute()`:

In [25]:
cursor.execute('INSERT INTO employees VALUES (?, ?, ?, ?)', (emp2.first_name, emp2.last_name, emp2.age, emp2.salary))
conn.commit()

De manera similar a lo que vimos anteriormente, cada signo de interrogación (`?`) será reemplazado por una variable (aquí no tenemos que poner comillas si una variable se trata de una cadena, eso lo hará automáticamente el método `execute`).

Y por último, veamos una tercera forma de insertar registro con ayuda de diccionarios:

In [28]:
cursor.execute('INSERT INTO employees VALUES (:first, :last, :age, :salary)', {'first' : emp3.first_name, 'last' : emp3.last_name, 'age' : emp3.age, 'salary' : emp3.salary})
conn.commit()

Cada `:key` que se encuentra en la cadena, será reemplazado por el valor de `key` en el diccionario.

Nuevamente, verificamos que los registros se insertaron a la tabla.

In [29]:
cursor.execute('SELECT * FROM employees')

rows = cursor.fetchall()
rows

[('Jhon', 'Campos', 24, 6000),
 ('Maria', 'Cruz', 22, 7000),
 ('Cielo', 'Ruiz', 27, 8000),
 ('Raul', 'Canales', 30, 100000),
 ('Jorge', 'Rodriguez', 20, 3800),
 ('Mateo', 'Puente', 26, 5000)]

Para automatizar y agilizar este proceso, podemos empaquetar la query de insertar un empleado en la tabla en una función:

In [30]:
def insert_emp(emp):
    cursor.execute('INSERT INTO employees VALUES (:first, :last, :age, :salary)', {'first' : emp.first_name, 'last' : emp.last_name, 'age' : emp.age, 'salary' : emp.salary})
    conn.commit()

In [31]:
emp4 = Employee('Lucia', 'Cuadrado', 28, 6000)
insert_emp(emp4)

In [32]:
cursor.execute('SELECT * FROM employees')

rows = cursor.fetchall()
rows

[('Jhon', 'Campos', 24, 6000),
 ('Maria', 'Cruz', 22, 7000),
 ('Cielo', 'Ruiz', 27, 8000),
 ('Raul', 'Canales', 30, 100000),
 ('Jorge', 'Rodriguez', 20, 3800),
 ('Mateo', 'Puente', 26, 5000),
 ('Lucia', 'Cuadrado', 28, 6000)]